"use strict";
//Основые объектоного программирования. Главную роль играет объект, он может в себе содержать методы и свойства, любой вид данных.
// Например - автомобиль - это объект, у него есть свои свойства - двигатель, ходовая и тд..
// Но у их потомков были разные двигатели, объемы, колеса и тд
// То есть у нас есть объект прототип с опр наобором характеристик и изменяю их немного, мы штампуем новые экзмепляры.
// Например - Прототип модельного окна, на основании которого, мы сделаем несколько новых не похожих друг на друга.
// Прототип пользовательского сайта и тд.
// ООП Это наука о том, как делать правильную архитектуру. 