// будем менять наш код в старый формат, при этом сейчас мы будем использовать Бэбел (7.0)
// Чтобы работать с этой технологией, нужен установленный node js
// в папку нужно переходить при помощи терминала и там инциализировать проект, если еще не иници
// пишем там npm init  далее пропускаем всё и соглашаемся 
// далее у нас появится packaje.json -там у нас будут все установлелные зависимости имена и тд
 //после инциализации нам нунжно поставить сама Бэбел
 // это один из методов подключения различных ПОЛИФИЛОВ !! есть и другие методы
 //1) скопировать команду прямо с сайта бэбела - там настройка, команды и пресеты 
 //2) там будет формироваться один большой файл ДЖС, далее нужно перейти в папку Бандл 
 //3) Там запускаем browserify 
 //  browseryfy script.js (файл) -o (output - куда будет выводиться) bundle.js (вместа значка > лучше исп -o)
 // далее сформируется наш файл. получится полифил, один большой файл, готовый на продакшн. - это самый правильный метод
  
 // Есть иррационацльный метод - когда берут бебел полифл и вписывают команду перед, но вес в 4 раза больше будет 





