// очень часто задачи будут такие, которые мы уже делали или нужно что то оперативно сделать
// мы должны понимать что делает чужой код и тд
//1) Слайдеры - один из самых популярных owpCarusel сайт, там есть готовые решения, это инструмент готовый с кучей натстроне
//2) Slick слайдер, похож на предыдущий, но менее гибок в работе 
//3) Слайдеры для показа фотографий - Фоторама сайт и галлерея слайдер 
// Можно просто загуглить и найти все что угодно
// Есть также ГитХаб, но нужно быть аккуратными, тк там работяги могут писать с ошибками
// Там я подключил цсс , джс файл и картинки и всё пошло

// Всегд ищем раздел с опциями

//  ТЕПЕРЬ ТАБЫ. Отдельных файло нет, тк скрипт очень легкий и просто модернизируется под себя
    // Всегда стараемся следить за версией jquery , разные плагины могут просить разные версии, что то новее, что то старее

   


